# Что делать, если мы хотим превратить Словарь Python в JSON объект? Для этого
# используем функции сериализации dump и dumps. Смысл окончания s у dumps
# такой же как и у loads

import json
my_dict = {
    "first_name": "Джон",
    "last_name": "Смит",
    "hobbies": ["кузнечное дело", "программирование",
    "путешествия"],
    "age": 35,
    "children": [
        {
        "first_name": "Алиса",
        "age": 5
        },
        {
        "first_name": "Маруся",
        "age": 3
        },
    ]
}
print(f'{type(my_dict) = }\n{my_dict = }')
with open('new_user.json', 'w') as f:
    json.dump(my_dict, f)

# Создаём словарь, открываем файл для записи и сохраняем содержимое функцией
# dump. В качестве первого аргумента функция получает словарь или список, вторым
# передаем файловый дескриптор либо другой объект, поддерживающий метод write.
# Сама функция dump ничего не возвращает.
# Если мы откроем файл new_user.json, увидим одну длинную строку