# Задание
# Убедимся, что вы сможете провести параллель между кортежами и списками,
# строками. Перед вами кортеж и несколько строк кода. Напишите, что вернёт
# каждая из них. Попробуйте справится с заданием без запуска кода. У вас 3 минуты.

my_tuple = (2, 4, 6, 2, 8, 10, 12, 14, 16, 18)
print(my_tuple[2:6:2]) # Выведет 6 и 8
print(my_tuple[-3]) # Выведет 14
print(my_tuple.count(2)) # Выведет 2
print(f'{my_tuple = }') # Выведет my_tuple = (2, 4, 6, 2, 8, 10, 12, 14, 16, 18)
print(my_tuple.index(2, 2)) # Выведет 3
print(type('text',)) # Выведет <class'str'>
