# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 

a = 1234
b = 'tsxt'
c = '@'
tap = [1,2,3,4,5,6,7,8]
boolean = True
new = {'asdf',124,True,3.141592}
print(type(a))
print(type(b))
print(type(c))
print(type(tap))
print(type(new))
print(type(boolean))