# Задание
# Перед вами строка текста и несколько строк кода, которые её меняют. Напишите
# что вернёт каждая из строк кода. Попробуйте справится с заданием без запуска
# кода. У вас 3 минуты.

text = 'Привет, мир!'
print(text.find(' ')) # 7
print(text.title()) # Привет, мир!
print(text.split()) # ['Привет,', 'мир!']
print(f'{text = :>25}') # text =              Привет, мир!